[33m7629eee[m[33m ([m[1;36mHEAD -> [m[1;32mdev[m[33m, [m[1;31morigin/master[m[33m, [m[1;31morigin/HEAD[m[33m, [m[1;32mmaster[m[33m)[m fix(module:lazy-targ-comp): fix lazy comp error
[33me770a38[m fix(module:serach-list): fix expand icon
[33m2fa4009[m fix(module:no-data): fix svg miss bug
[33m077656a[m feat(module:no-data): add no-data page
[33m7c45932[m fix(module:ant-table): fix table filed if has not tableHead
[33ma86f9c9[m style: add login explain
[33mb4cef6b[m feat(module:form): add shrink-form module
[33m9b85109[m feat(module:network-error): add network-error page
[33m8095396[m feat: add angular-tools file
[33m53bc99b[m style: files fixed by eslint
[33mcaa32f6[m Merge pull request #21 from huajian123/v14
[33m247b58a[m chore(release 14): update to 14
[33m882e06a[m style: files fixed by eslint
[33m72c6718[m style(fade.animation): fix eslint style
[33m3d139df[m chore: add eslint
[33m43dbba4[m chore: update to v14
[33mbf8d323[m fix(component:ant-table): fixed cash checkbox
[33m9e17b6c[m fix(module:editor): fixed editor code
[33m9babae8[m Merge pull request #20 from Old-ear/master
[33m6604933[m feat：add code-editor(powered by monaco)
[33m458c6f0[m fix：setting-drawer add opacity to show dom below
[33me1ff900[m Merge pull request #19 from Old-ear/master
[33mbcf0ff9[m fix：update copyright
[33m0d0e5a1[m add:动态添加主题色
[33mcdc72ba[m 遗留通用type位置重新划分，优化step组件代码
[33m6a6ec6e[m menu性能优化
[33m8fc2ad3[m 添加在线文档
[33m3e74311[m 修改parentId为parentId
[33m3f12c31[m 封装windows对象
[33m1eaf9eb[m 添加树桩结构表格，展开状态保持的功能
[33mef00115[m 手动添加标签页操作中，打开详情的页的操作权限
[33m6113005[m 添加部分示例移动端适配
[33me5b7304[m NgAntAdmin 3.0!
[33m4eab34d[m NgAntAdmin 3.0!
[33madb431c[m NgAntAdmin 3.0!
[33mbf75762[m NgAntAdmin 3.0!
[33mbbeea7f[m chart移动端适配
[33me3d2df1[m 添加百度地图 ，echart示例
[33m21607c6[m 添加滚动懒加载
[33maa03479[m 优化menu在外部连接时的padding以及select方式
[33m738ef31[m 添加外部文档demo
[33ma4b67a9[m 修改登录逻辑，模拟从接口中获取menu的场景
[33m4fd0199[m 删除内部管理模块
[33m5c9fc7b[m 修复在混合模式下，左侧菜单过多，未出现滚动条的bug
[33m633263a[m 蔡依林改成周杰伦
[33m7578394[m 完成懒加载组件示例
[33mc9237e8[m 代码优化
[33mba8eaed[m Merge pull request #14 from fanbaolin666/master
[33m513edc0[m Merge branch 'huajian123:master' into master
[33m73c659c[m comp-strength-meter 优化导入
[33mfc7764b[m comp-strength-meter 优化导入
[33m026d5c3[m comp-strength-meter
[33m06df4fa[m 减少触发不必要的脏值检测
[33mfd20cbd[m 添加在线excel示例
[33m5aa2b7a[m 升级zorro
[33m500c976[m Merge pull request #13 from fanbaolin666/master
[33m52be04e[m Merge branch 'huajian123:master' into master
[33mffcd1d6[m comp-desc
[33me86ddcb[m 添加dailog扩展
[33m72e84bf[m Merge pull request #12 from fanbaolin666/master
[33m1f56025[m Merge branch 'huajian123:master' into master
[33m76fffad[m comp-basic
[33m555877c[m 添加动画组件示例
[33m8cbd0b4[m Merge branch 'huajian123:master' into master
[33mbb3f0f0[m 调整菜单结构
[33m86187c0[m 调整菜单结构
[33m663d1e7[m 添加全屏功能组件
[33mcac92cd[m msg优化
[33m2126f12[m feat-routing msg routing
[33mb6ec63f[m Merge pull request #11 from fanbaolin666/master
[33m623a61b[m 消息提示功能完成
[33m9142aa7[m 添加右键菜单，图片预览模块
[33m96e94cd[m 修复滚动条缓存在新tab详情下失效的bug
[33ma3e9c18[m 添加打开新的tab页展示的详情模式
[33mde0e318[m 右键点击关闭左侧tab为第一个时，return
[33m08ee9f8[m 添加标签页操作功能演示示例，添加tab关闭左侧tab的功能。
[33m592925a[m 添加滚动条示例，修复tab没菜单下的bug
[33md0df74f[m 添加抽屉封装，添加引导页
[33m1fc42fd[m 添加复制内容，水波纹的案例
[33m975f7e7[m 退出登录时清空滚动条缓存状态
[33md1c378c[m 添加图标示例
[33m2611dcf[m 滚动条缓存示例添加移动端适配
[33mad45a45[m 添加缓存滚动条位置示例
[33mc337f2a[m 修复混合模式，非自动分割菜单时，固定tab在只有一级菜单时，样式错位的bug
[33md75c661[m 添加阿里图标库图标支持，修改部分菜单结构
[33m1280890[m 添加固定tab功能，多级菜单演示
[33ma285e1d[m 添加固定tab页签功能
[33m08e9d2e[m 修复在详情页面中，刷新页面路由不匹配的问题
[33md508d8c[m 添加table虚拟滚动配置
[33m8585273[m 重装服务器系统，修改端口号
[33me4e039d[m 添加颜色选择器
[33me4afd12[m 添加二开详解
[33m85d13a1[m 完善schematic
[33m00c2a6b[m 添加click-out-side组件
[33m4bfedbc[m 升级angular已解决打包报错
[33m227165a[m 升级angular-cli
[33maeb78ab[m 修复foot-submit中的内存泄漏问题
[33m44a13fe[m 添加关于页面
[33m94c372e[m 修复footSubmit宽度不自适应的bug
[33mdc72ed5[m 移除告知
[33m8f85945[m 添加支付宝和微信
[33ma1f8bc0[m 搜索列表页优化表格示例，添加设置按钮拓展功能，添加重置密码功能，优化菜单展示性能，修复top模式与混合模式切换时，有二级的菜单切换不自动open的bug
[33ma2ae6ee[m 拓展对话框全屏功能
[33m615bdf6[m 优化销毁函数
[33m145e1e9[m 添加自动回复机器人
[33m9c3b97f[m 添加高德地图和富文本示例
[33mad5dd93[m 优化表格示例
[33m2409aaf[m 添加tree表格示例
[33m7068827[m 添加移动端登录页的适配
[33mba39c3c[m 添加新的登录模式，与清除缓存功能
[33m490806c[m 添加流程图链接点
[33m58e2b08[m 添加流程图模块
[33m3beddd1[m 用cdk传送点重构分步表单，用自定义表单重构高级表单
[33m5a2bff4[m 修复移动端适配问题
[33m3ce726a[m 修复拖拽对话框无法设置z-index的问题
[33m776b045[m 对锁屏状态添加安全防护措施
[33m441f77b[m 添加MIT协议
[33m83e66a5[m 修改锁屏页面日期的z-index
[33m0037921[m Merge branch 'master' of https://github.com/huajian123/ng-ant-admin
[33m519c610[m 修复对话框无法拖动的bug
[33m7ced203[m 修复锁屏时返回后表单状态未重置的bug
[33mc7d59a9[m 添加锁屏功能
[33ma6ae501[m 添加schematics
[33md7d25c9[m 改一改readme
[33m6dbc658[m 修复全屏时esc按钮不能被监听的bug
[33m75752c3[m 修复全屏时esc按钮不能被监听的bug
[33m9937218[m 添加全屏操作按钮
[33md4937f9[m 添加qq群号
[33m4cc66e2[m 添加路径别名
[33m613ae6e[m 添加工具方法
[33m3e1ff5c[m Merge branch 'master' of https://github.com/huajian123/ng-ant-admin
[33me7c317d[m 对话框基类，添加没有title，也支持拖拽
[33m620126f[m Update README.md
[33m0fa690f[m 升级ng13
[33m7272a0a[m 添加引导页功能
[33m9f6b3aa[m 部分移动端适配问题解决
[33m938779a[m 修复刷新页面loading动画不流畅的问题
[33ma99d26b[m 添加路由动画
[33m31df39e[m 修复table全选按钮不刷新状态的bug
[33m4c6f626[m 修复模拟登录权限不对的问题
[33ma3b333c[m table增强可以通过.的方式获取字段，修复底部submit样式问题
[33mf0d4011[m 添加http请求模板，添加路由守卫，登录拦截，添加权限模板方案
[33md1de90b[m 修复基础
[33m146786c[m 表格添加排序功能
[33m568855e[m 修改对话框弹出模式为依赖注入，表格添加排序功能
[33ma4ef376[m 代码优化
[33m0134408[m 船新版本
[33m61fcb5d[m 船新版本
[33m46cae90[m 修改内部管理相关接口
[33m8048eaf[m Merge branch 'master' of https://github.com/huajian123/ng-ant-admin
[33mfca118a[m 添加页面刷新的功能
[33m8b08738[m 修改表格wrap的按钮实现模式
[33m033d723[m 添加表格列头可拖动功能
[33m306bb55[m 添加模态框拖拽示例
[33m8da0563[m Merge branch 'master' of https://github.com/huajian123/ng-ant-admin
[33mecd65fb[m 添加模态框拖拽示例
[33m761232e[m Update README.md
[33m58a313f[m chat兼容笔记本
[33m1bb4052[m 更换策略
[33m24edcbe[m 升级ng12
[33m26df0c3[m 添加未读样式
[33mfaf7b8b[m 添加分析页，监控页头部样式，添加一个导航
[33m806588e[m 添加分析页，监控页头部样式，添加一个导航
[33me0ad025[m 解决快速敲击回车闪频的问题
[33m9fd2416[m 禁止输入空字符
[33me2f9b45[m 优化联系客服代码
[33ma93a865[m 联系客服增加关闭对话框功能
[33mc88a7b0[m 添加联系客服的功能
[33m33a4cdf[m Merge branch 'master' of https://github.com/huajian123/ng-ant-admin
[33m4c67a67[m 修改默认的主题设置
[33m823af35[m 添加导出方式service
[33m6a7781f[m 表格添加是否可以滚动
[33m5990ec3[m 修改样例代码
[33ma30420d[m 修改readme
[33mf9ec7ca[m 兼容只有一级子菜单的情况，混合模式下的样式问题
[33mec85080[m 修复混合模式下顶部菜单如果没有子菜单，左侧菜单还显示的bug
[33mcc9b296[m 添加请点star的小功能
[33mb128a14[m 添加请点star的小功能
[33m340756c[m 添加移动端适配
[33m51bacc7[m 添加移动端适配
[33m1ead2fc[m 添加在线预览地址readme
[33mf61e549[m 添加列表页详情显例
[33m2ba2ad7[m 修改报错
[33m9db4fa0[m 代码提交
[33mc24222d[m 添加头部图标假的国际化
[33m48c700b[m 添加通知功能样式
[33m1739dcf[m 添加混合模式响应式布局
[33mdaf3e0d[m 添加自动分割菜单功能
[33m80c1f84[m 添加混合菜单模式
[33m2a0d27d[m 修复menu下啦的问题
[33m500b4f4[m 修改部分主题模式
[33m8de0015[m 添加注释
[33ma206dbb[m 添加各种主题
[33m8982262[m 在设置页面添加混合模式按钮
[33mfefdc3e[m 样式微调
[33m7de6402[m 左侧菜单细节调整
[33m60df30c[m 修复zorro警告
[33m765e759[m 修改一些主题设置
[33m8c9f269[m 修改setting
[33mb453e4f[m 修复固定头部bug
[33m34ac5c7[m 添加固定头部功能
[33md26e2d0[m 添加改变页签标题功能
[33m50f4a12[m 添加水印
[33m3aa661d[m 添加搜索列表页面
[33m1999e9d[m 添加search页面监听
[33m2c0a7fa[m 添加搜索列表路由
[33m50bbc11[m 完成卡片表格页面
[33ma647880[m 添加标准表格页面内容
[33m701071e[m 完成一部分标准列表
[33mdc46ced[m 添加标准表格，卡片表格路由
[33m7632846[m 添加水印
[33m8f9a37d[m 修改查询表格
[33md86d20d[m 高级详情页完善
[33m7971896[m 添加高级详情页面
[33m15dcb9d[m 左侧菜单导航添加nzTrigger
[33mf976913[m 添加水印功能
[33m6b04c78[m 修改markdown
[33m320f754[m 添加在线图片
[33m53afc28[m 测试markdown中放置图片
[33m62f5070[m 添加系统截图
[33me4bcbb1[m 添加系统截图
[33m3380d29[m 添加全局Loading
[33m5f3c21c[m 修复无法切换登录页的bug
[33m98f9cdf[m 修复无法切换登录页的bug
[33mca74f40[m 解决从登录页登陆后的页面，路由状态保存失效的问题
[33m17f89dc[m 优化更新
[33mee804f3[m 添加菜单顶部模式的图标
[33m8b8f5fc[m 移除没有做的菜单
[33mab22305[m 删除多余代码
[33mff94606[m 移除收缩按钮
[33m8c24897[m 添加403
[33m5803a67[m 优化表格
[33m49cbdfe[m 进行一波同步
[33m8fe5dba[m 提交代码
[33m4811716[m 提交代码
[33mfc54ae4[m 添加美化滚动条
[33m37035f6[m 修复固定列宽样式问题
[33me84e989[m 设置为不需要后台即可登陆系统
[33m233a586[m 设置为不需要后台即可登陆系统
[33m89729fe[m 添加移除组件生命周期
[33m6ac94f8[m 提交代码
[33medbaccc[m 表格增加省略功能
[33m285ba36[m 修复对话框点击关闭时报错的问题
[33ma4e2837[m 添加数组对象去重方法
[33m464752e[m 添加query传参支持
[33m226c50e[m 添加任务详情样式
[33mfbee3cc[m 添加多标签下的生命周期
[33m58d8df1[m 修改menu文件位置
[33m04a17ab[m 代码提交
[33m40a9401[m 代码提交
[33m4c4b3f5[m 代码提交
[33m5bfd48a[m 代码优化
[33m948148d[m 样式优化
[33md731be9[m 工作台页面结构修改
[33mfd61a7d[m 代码提交
[33mb083d49[m 添加成功页和失败页
[33m827e70f[m 添加成功页，失败页，模块
[33md15e464[m 添加异常页内容
[33m681621e[m 添加403 404 500页面
[33md0c1cd7[m 添加个人设置界面
[33m9d9a5f0[m 添加消息通知页面
[33m716d996[m 测试2
[33m3709272[m 测试
[33mfb4fc40[m 测试
[33m5a568d3[m 代码提交
[33m8682447[m 添加基本设置界面
[33mbe2d473[m 完成个人设置基本设置样式
[33m1125f63[m 添加个人设置页面结构
[33m2311b4c[m 个人设置添加动态组件
[33mfb1838b[m 添加个人设置子项组件
[33m665842f[m 修复部分样式问题
[33m9eb29e2[m 添加个人设置页面主要框架
[33mda9f5ad[m 添加项目
[33m5f48ecb[m 添加响应式
[33m76693ea[m 个人中心，个人设置界面跳转
[33m6f5ce18[m 添加个人中心，应用页面
[33mde7aa64[m 文章页面
[33m3952f7e[m 添加动态组件类型
[33m1926be9[m 添加个人中心动态组件
[33m9bd929b[m 添加个人设置模块页面
[33mdc6479d[m 添加个人中心，个人设置模块
[33m5b1d2d1[m 完成基础表单
[33mc5bd204[m 工作台界面完成
[33mf6a2ff6[m 代码提交
[33mfb94ec8[m 完成监控页样式
[33m070b7a9[m 完成工作台头部
[33me5c02b9[m 添加搜索列表页面
[33m490ee48[m 完成监控页样式
[33maaf44dc[m 添加通用的页脚
[33mef34477[m 新增监控页右侧板块
[33m8c5a095[m 修改angular默认导出规则
[33m4dde2d9[m 代码提交
[33m4c341a2[m 添加L7地图
[33mddb0178[m 添加地图
[33m8c9912f[m 修复左侧菜单在非over模式时不自动关闭得bug
[33m462a336[m 修复色弱模式，在特定情况下不显示得问题
[33m0b3b8af[m 修复色弱模式不被缓存得bug
[33meea9183[m 修改样式
[33m5953d57[m 代码优化
[33me9f12e8[m 菜单添加over模式
[33m16e5f3f[m 添加监控页样式
[33m0316798[m 修改分布表单样式
[33m43fbbc5[m 修复收缩按钮展示错误得bug
[33mea39687[m 添加复选框
[33md2c8ec0[m 添加loading动画
[33mdf0deb8[m 添加loading动画
[33mdf080a8[m 添加顶部进度条
[33m5f01031[m 修改主题缓存
[33mf8f3625[m 主题缓存
[33m415fd48[m 修复退出登陆后还有tab标签的bug
[33m5a51a2f[m 添加重置密码功能
[33ma276550[m 添加修改用户功能
[33m694a217[m 添加新增用户功能
[33mf658a3e[m 添加新增用户功能
[33m682e84f[m 代码提交
[33m95881da[m 用户对话框添加自定义验证器
[33m8545b90[m 添加表单自定义验证器
[33m5a81591[m 代码提交
[33mc96e809[m 人员管理添加查询功能
[33m1eb65f1[m 添加用户管理对话框
[33m57e728f[m 修改角色管理文件名
[33m3d23513[m 用户管理列表展示功能
[33me4b6052[m 添加打包大小限制值
[33mf9a71e3[m 添加过滤器
[33m27484e4[m 用户管理
[33mb2d62a6[m 重构主题系统3
[33m8ad5a0d[m 重构主题系统2
[33m61c9c4d[m 修改settings样式
[33mb0206c6[m 重构主题系统1
[33m5609548[m 添加用户管理页面
[33mc2d0e3a[m 添加批量删除
[33m85835d3[m 修复权限指令报错的bug
[33m151c508[m 部门删除
[33m1a9c9eb[m 增加部门管理增删改查
[33md58b482[m 添加部门模块新增修改模态框
[33mb383e85[m 修复bug
[33mf3e5442[m 移除分页
[33m52cec1a[m 添加部门列表展示功能
[33m97a698f[m 添加展示部门列表交互
[33ma5b1df4[m 修改部门管理头部信息
[33mc2df649[m 添加部门管理
[33maf98559[m 路由名称优化
[33me582d78[m 更改路由预加载策略
[33m65e9d17[m 升级zorro
[33mab80ed4[m 修改权限不生效的bug
[33md4388a3[m 添加权限吗
[33m9ce85f8[m 添加登录超时拦截处理
[33m5375b6c[m 添加用户类型
[33m30c65f2[m 删除多余文件
[33m9a8cbc9[m 添加分析也最后一个板块dom
[33m234ad1b[m 修改分析页样式
[33m2acd093[m auth如果token解析失败，进行错误处理
